#+STARTUP: overview 
** Org-agenda
#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
   '(("h" "Daily habits"
      ((agenda ""))
      ((org-agenda-show-log t)
       (org-agenda-ndays 1)
       (org-agenda-log-mode-items '(state))
       (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp ":DAILY:"))))))
#+END_SRC

#+RESULTS:
| h | Daily habits | ((agenda )) | ((org-agenda-show-log t) (org-agenda-ndays 1) (org-agenda-log-mode-items (quote (state))) (org-agenda-skip-function (quote (org-agenda-skip-entry-if (quote notregexp) :DAILY:)))) |

